//Напишите программу, которая перевернёт одномерный массив 
//(первый элемент станет последним, второй – предпоследним и т.д.)
int[] arr = { 5,6,3,89,25,1};
Array.Reverse(arr);


foreach (var item in arr)
{
    Console.Write(item);
}

